---
kind: type
id: T:Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
source: html/ef0073c4-f86b-64b9-12f2-268f4e1b8bbe.htm
---
# Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs

The base class used for pre events where the arguments must supply access to the document.

## Syntax (C#)
```csharp
public class RevitAPIPreDocEventArgs : RevitAPIPreEventArgs
```